   /* Демонстрация вычисления "машинного эпсилон" */
   /* с использованием цикла do/while.            */
   /*  "Машинное эпсилон" - это максимально воз-  */
   /* можное значение переменной типа float, та-  */
   /* кое, что 1.0+x=1.0                          */
   /* ------------------------------------------- */
   #include<stdio.h>
   #include<float.h>
   #include<conio.h>
   int main()
   {
      float eps=1.0,  /* Начальное значение "машинного эпсилон" */
	    x=1.0, y, /* Рабочие переменные                     */
	    eps2;     /* "Машинное эпсилон"                     */
      /* ------------------------------------------------------ */
      do
      {
        eps=eps/2; y=x+eps;
      }
      while (y>x);
      eps2=2*eps;
      printf("Вычисленное значение eps   : %1.16e\n",eps2);
      /* ----------------------------------------------- */
      /*   Воспользуемся трансформационной семантикой    */
      /* ----------------------------------------------- */
      eps=1.0; x=1.0; 
      eps=eps/2; y=x+eps;
      while (y>x)
      {
        eps=eps/2; y=x+eps;
      }
      eps2=2*eps;
      /* ----------------------------------------------- */
      printf("Вычисленное значение eps   : %1.16e\n",eps2);
      printf("\"Библиотечное\" значение eps: %1.16e\n\n",
					  FLT_EPSILON);
      getch();
      return 0;
  }