"""
    Автор: Моисеенко Павел, группа № 1, подгруппа № 2.

    Задание: в правильной четырехугольной пирамиде высота равна h,
    объем равен v. Найдите боковое ребро этой пирамиды. Решение офор-
    мите в виде функции rib(h,v), которая возвращает результат l.
    Например, при h=12; v=200 функция rib(12,200) вернет l=13.

"""

import math


def rib(h, v):
    a = math.sqrt(3 * v / h)
    L = math.sqrt(h ** 2 + (a / (2 * math.sin(45*math.pi/180))) ** 2)
    return L


def main():
    h = int(input("Введите высоту h: "))
    v = int(input("Введите объём V: "))
    if (h > 0) and (v > 0):
        print("Бокоовое ребро пирамиды l = " + str(rib(h, v)))
    else:
        print("Введите числа больше 0.\n")
        main()


print("Программа вычисляет боковое ребро правильной четырёхугольной пирамиды"
      " по высоте h и объёму V.")
main()
