"""
    Автор: Моисеенко Павел, группа № 1, подгруппа № 2.

    ИСР 1.3. Задание: разработать скрипт, позволяющий вычислить площадь треугольника с помощью формулы Герона.

"""


def area(a, b, c):
    p = (a + b + c) / 2
    return (p * (p-a) * (p-b) * (p-c)) ** (1/2)


def main():
    a = int(input())
    b = int(input())
    c = int(input())
    if (a > 0) and (b > 0) and (c > 0):
        print("Площадь = " + str(area(a, b, c)) + ".")
    else:
        print("Введите значения больше 0.")


print("Программа считает площадь треугольника по формуле Герона.\n"
      "Введите значения сторон треугольника a, b, c.")

main()
