   /* Демонстрация вычисления элементов линейных рекур- */
   /* рентных последовательностей заданного порядка     */
   /* ------------------------------------------------- */
   #include<stdio.h>
   #include<conio.h>
   #define BOUND 40
      int Fun1(int);
      int Fun2(int);
  /* ------------- */
   int main()
   {
      int i;
      /* ------------------ */
      for (i=1; i<=BOUND; i++)
	printf(" f1(%2d)=%-10d f2(%2d)=%-10d\n",
	       i,Fun1(i),i,Fun2(i));
      printf("\n\n");
      getch();
      return 0;
   }
  /* ----------- */
   int Fun1(int n)
   /* Рекурсивная функция для  вычисления */
   /* элементов рекуррентного соотношения */
   /*                                     */
   /* a   -2a   +a =0, a =1, a =2         */
   /*  n+2   n+1  n     1     2           */
   /* ----------------------------------- */
   {
     if (n==1)
       return 1;                             /* Начальное условие */
     else if (n==2)
	    return 2;                        /* Начальное условие */
	  else return 2*Fun1(n-1)-Fun1(n-2); /* Соотношение       */
   }
  /* ----------- */
   int Fun2(int n)
   /* Нерекурсивная функция для вычисления */
   /* элементов рекуррентного соотношения  */
   /*                                      */
   /* a   -2a   +a =0, a =1, a =2          */
   /*  n+2   n+1  n     1     2            */
   /* ------------------------------------ */
   {
      int i,a[3];
      /* ------ */
      if (n==1)
	return 1;
      else if (n==2)
	     return 2;
	   else {
		  a[1]=1; a[2]=2;         /* Начальные условия */
		  for (i=3;i<=n;i++)
		  {
		    a[3]=2*a[2]-a[1];     /* Соотношение */
		    a[1]=a[2]; a[2]=a[3];
		  }
		  return a[3];
		}
   }
